app/Config/Routes.php

 * @var RouteCollection $routes
 */
$routes_model  = new \App\Models\RouteModel();
$routes_data = $routes_model->findAll();
---
SELECT *
FROM `routes`