app/Controllers/Public/BaseController.php

SELECT `menus`.*, `ms`.`id` as `sub_id`, `ms`.`title` as `sub_title`, `ms`.`url` as `sub_url`, `ms`.`active` as `sub_active`
FROM `menus`
LEFT JOIN `menus` as `ms` ON `menus`.`id` = `ms`.`parent_id`
WHERE `menus`.`parent_id` IS NULL
AND `menus`.`active` = 1
AND `menus`.`is_admin` IN (0,0)
AND `menus`.`is_user` IN (0,0)
AND `menus`.`id` NOT IN (-1)
ORDER BY `parent_row_order` ASC, `ms`.`row_order` ASC
---
    public function initController(RequestInterface $request, ResponseInterface $response, LoggerInterface $logger)
    {
        // Do Not Edit This Line
        parent::initController($request, $response, $logger);

        $this->validation = \Config\Services::validation();

        $this->data["page"]["settings"]["title"] = "Tolga KARTAL - Anasayfa";
        $this->data["page"]["settings"]["nav_title"] = "Tolga KARTAL";

        $this->session = session();
        $user_in = ($this->session->has('user')?1:0);
        $admin_in =($this->session->has('user') && $this->session->get('user')["is_admin"]=='1' ? 1 : 0);

        $whereClause = [];
        if ($admin_in==1) {
            $whereClause    = ["menus.is_admin"=>1];
        }
        else if($user_in==1){
            $whereClause    = ["menus.is_user"=>1];
        }
        else{
            $whereClause    = ["menus.is_public"=>1];
        }

        $menus_model = new \App\Models\MenuModel();
        $menus = $menus_model->select("menus.*
                                                ,ms.id as sub_id
                                                ,ms.title as sub_title
                                                ,if(ms.parent_id=2,concat('category/',ms.url),ms.url) as sub_url
                                                ,ms.active as sub_active")
                                       ->where("menus.parent_id",null)
                                       ->join("menus as ms","menus.id = ms.parent_id","left")
                                       ->where($whereClause)
                                       ->where("menus.active",1)
                                       ->where("(ms.active=1 OR ms.active IS NULL)")
                                       ->orderBy("parent_row_order","ASC")
                                       ->orderBy("ms.row_order","ASC")
                                       ->findAll();